# Taps
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'

# Development
brew 'imagemagick'

# Apps
cask '1password'
brew '1password-cli'
cask 'keepingyouawake'
cask 'firefox'
cask 'google-chrome'
cask 'httpie'
cask 'imageoptim'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-inconsolata'
cask 'font-source-code-pro'
